/* Моменти, які варто нагадати, перед виконанням лабораторної роботи
1. Май повагу до чужого труду. Не змінюй або видаляй чужий код без дозволу
2. Страйся писати розбірчивий код. (Нормальні назви змінних і функцій, не обічрана логіка і т.д.)
3. Коментарі лишніми не будуть ніколи
*/
// 1:15 love dicks
//Версія Віталіка
//0:09
#include <iostream>
#include <string>

using namespace std;


//=======
#include <iostream>
#include <string>

using namespace std;


//Клас сцена - основна "ячейка" даних нашої програми
//В ньому зберігаються вся інформація про кожну сцену нашої історії
class Scene{

    public:
};

//Функція для зчитування даних
void input(){

};
//Важлива частина нашої програми - перевірка вводу
//Функція, що перевіряє ввід 
bool check(char a){
    return 1;
};


int main(void){
    //Ширина маленькького віконця 80
    for(int i=0; i<80; i++){
        //Довжина маленького віконця 24
        for(int j=0; j<24; j++){
        cout << "_";
        }
    }
}


