/* Моменти, які варто нагадати, перед виконанням курсової роботи роботи
1. Май повагу до чужого труду. Не змінюй або видаляй чужий код без дозволу
2. Страйся писати розбірчивий код. (Нормальні назви змінних і функцій, не обічрана логіка і т.д.)
3. Коментарі лишніми не будуть ніколи
*/

#include "function.h" //підключення нашої бібліотеки зі всіма функціями

int main()
{
    int i = 0;
    scene script[N];
    input info; // структура для збереження даних, що вводить користувач
    // introduction(); // функція, що ознайомлює користувача з ідеєю гри
    f_input(&info); // функція вводу даних користоувачем
    cut_paste(info, &script[0]);
    // cout <<"Name: "<< info.name << " " << info.noun << " " << info.numeric << " " << info.body << " " << info.verb << endl;

    for (i = 0; i < 6; i++)
    {                          //ітераційний цикл що виводить в консоль сторінки історії
        show_scene(script[i]); //функція виводу ілюстрації, роздільної лінії та репліки в консоль
        answer();
    }

    if (choice_f())
    { // В залежності від вибору починати з різних сцен
        for (i = 6; i < 10; i++)
        {                          //ітераційний цикл що виводить в консоль сторінки історії
            show_scene(script[i]); //функція виводу ілюстрації, роздільної лінії та репліки в консоль
            answer();
        }
    }

    for (i = 10; i < 20; i++)
    {
        show_scene(script[i]); //функція виводу ілюстрації, роздільної лінії та репліки в консоль
        answer();
    }

    if (stoi(info.numeric) < 1500)
    { // Сюжетна розвилка
        for (i = 20; i < 32; i++)
        {
            show_scene(script[i]); //функція виводу ілюстрації, роздільної лінії та репліки в консоль
            answer();
        }
        if (choice_s())
        {
            for (i = 32; i < 48; i++)
            {
                show_scene(script[i]); //функція виводу ілюстрації, роздільної лінії та репліки в консоль
                answer();
            }} else {
                for (i = 48; i < 68; i++)
                {
                    show_scene(script[i]); //функція виводу ілюстрації, роздільної лінії та репліки в консоль
                    answer();
                }
            }
        }
    else
    {
        for (i = 68; i < 85; i++)
        {
            show_scene(script[i]); //функція виводу ілюстрації, роздільної лінії та репліки в консоль
            answer();
        }
    }
    return 0;
}