/* Моменти, які варто нагадати, перед виконанням курсової роботи роботи
1. Май повагу до чужого труду. Не змінюй або видаляй чужий код без дозволу
2. Страйся писати розбірчивий код. (Нормальні назви змінних і функцій, не обічрана логіка і т.д.)
3. Коментарі лишніми не будуть ніколи
*/

#include "function.h" //підключення нашої бібліотеки зі всіма функціями

int main(){
    scene script[N];
    input info; // структура для збереження даних, що вводить користувач
    //intro(); // функція, що ознайомлює користувача з ідеєю гри
    f_input(&info); // функція вводу даних користоувачем
    cut_paste(info, &script[0]);

    storytale(0, 6, script);
    if (choice_f())
    { // В залежності від вибору починати з різних сцен
        storytale(6, 10, script);
    }
    storytale(10, 20, script);

    if (stoi(info.numeric) < 1500)
    { // Сюжетна розвилка
        storytale(20, 32, script);
        if (choice_s()){
            storytale(32, 48, script);
        } else {
            storytale(48, 68, script);
        }
    } else {
        storytale(68, 85, script);
    }
    //outro();
    return 0;
}